In [1]:
pip install pandas

Collecting pandas
  Downloading pandas-2.3.0-cp313-cp313-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\a864911\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\a864911\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\a864911\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.0-cp313-cp313-win_amd64.whl (11.0 MB)
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
   ------------ --------------------------- 3.4/11.0 MB 21.8 MB/s eta 0:00:01
   ---------------- ----------------------- 4.5/11.0 MB 12.0 MB/s eta 0:00:01
   -------------------- ------------------- 5.5/11.0 MB 10.2 MB/s eta 0:00:01
   ----------------------- ---------------- 6.6/11.0 MB 8.2 MB/s eta 0:00:01
   --------------------------- ------------ 7.6/11.0 MB 7.6 MB/s eta 0:00:01
   -------------------------------- ------- 8.9/11.0 MB 7.3 MB/s eta 0:00:01
   ---------------------------------- ----- 9.4/11.0 MB 6.7 MB/s eta 0:00:01
   ------------------------------------ --- 10.0/11.0 MB 6.1 MB/s eta 0:00:01
   -------------------------------------- - 10.5/11.0 MB 5.7 MB/s eta 0:00:01
   ---------------------------------------- 11.0/11.0 MB 5.4 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.3.0 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd
pd.__version__

'2.3.0'

In [5]:
df=pd.read_csv(r'C:\DataScience-GenerativeAI-AgenticAI\Practical\DS-GenAi-AgenticAI-Bootcamp\6-month-AI-Roadmap_2025\Shared\gdp_data.csv')

In [7]:
df.describe()

               year         value
count  13365.000000  1.336500e+04
mean    1994.478563  1.207051e+12
std       17.459585  5.413230e+12
min     1960.000000  8.824746e+06
25%     1980.000000  2.523472e+09
50%     1996.000000  1.842778e+10
75%     2009.000000  2.240000e+11
max     2022.000000  1.010000e+14

In [8]:
id(df)

2261182839120

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
len(df)

13365

In [11]:
df.columns

Index(['country_name', 'country_code', 'year', 'value'], dtype='object')

In [12]:
len(df.columns)

4

In [ ]:
df.shape #Rows,Column

(13365, 4)

In [17]:
df.isnull()

       country_name  country_code   year  value
0             False         False  False  False
1             False         False  False  False
2             False         False  False  False
3             False         False  False  False
4             False         False  False  False
...             ...           ...    ...    ...
13360         False         False  False  False
13361         False         False  False  False
13362         False         False  False  False
13363         False         False  False  False
13364         False         False  False  False

[13365 rows x 4 columns]

In [19]:
df.isna()

       country_name  country_code   year  value
0             False         False  False  False
1             False         False  False  False
2             False         False  False  False
3             False         False  False  False
4             False         False  False  False
...             ...           ...    ...    ...
13360         False         False  False  False
13361         False         False  False  False
13362         False         False  False  False
13363         False         False  False  False
13364         False         False  False  False

[13365 rows x 4 columns]

In [22]:
df.isnull().sum()

country_name    0
country_code    0
year            0
value           0
dtype: int64

In [23]:
df.head()

  country_name country_code  year        value
0  Afghanistan          AFG  1960  537777811.1
1  Afghanistan          AFG  1961  548888895.6
2  Afghanistan          AFG  1962  546666677.8
3  Afghanistan          AFG  1963  751111191.1
4  Afghanistan          AFG  1964  800000044.4

In [ ]:
df.tail() #bottom 5 rows

      country_name country_code  year         value
13360     Zimbabwe          ZWE  2018  3.415607e+10
13361     Zimbabwe          ZWE  2019  2.183223e+10
13362     Zimbabwe          ZWE  2020  2.150970e+10
13363     Zimbabwe          ZWE  2021  2.837124e+10
13364     Zimbabwe          ZWE  2022  2.067806e+10

In [ ]:
df.dtypes #CountryCode is categorical data but consider as object

country_name     object
country_code     object
year              int64
value           float64
dtype: object

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13365 entries, 0 to 13364
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   country_name  13365 non-null  object
 1   country_code  13365 non-null  object
 2   year          13365 non-null  int64
 3   value         13365 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 417.8+ KB

In [27]:
#slicing in dataframe
df[:]

      country_name country_code  year         value
0      Afghanistan          AFG  1960  5.377778e+08
1      Afghanistan          AFG  1961  5.488889e+08
2      Afghanistan          AFG  1962  5.466667e+08
3      Afghanistan          AFG  1963  7.511112e+08
4      Afghanistan          AFG  1964  8.000000e+08
...            ...          ...   ...           ...
13360     Zimbabwe          ZWE  2018  3.415607e+10
13361     Zimbabwe          ZWE  2019  2.183223e+10
13362     Zimbabwe          ZWE  2020  2.150970e+10
13363     Zimbabwe          ZWE  2021  2.837124e+10
13364     Zimbabwe          ZWE  2022  2.067806e+10

[13365 rows x 4 columns]

In [28]:
df[::-1]

      country_name country_code  year         value
13364     Zimbabwe          ZWE  2022  2.067806e+10
13363     Zimbabwe          ZWE  2021  2.837124e+10
13362     Zimbabwe          ZWE  2020  2.150970e+10
13361     Zimbabwe          ZWE  2019  2.183223e+10
13360     Zimbabwe          ZWE  2018  3.415607e+10
...            ...          ...   ...           ...
4      Afghanistan          AFG  1964  8.000000e+08
3      Afghanistan          AFG  1963  7.511112e+08
2      Afghanistan          AFG  1962  5.466667e+08
1      Afghanistan          AFG  1961  5.488889e+08
0      Afghanistan          AFG  1960  5.377778e+08

[13365 rows x 4 columns]

In [29]:
df[:11]

   country_name country_code  year         value
0   Afghanistan          AFG  1960  5.377778e+08
1   Afghanistan          AFG  1961  5.488889e+08
2   Afghanistan          AFG  1962  5.466667e+08
3   Afghanistan          AFG  1963  7.511112e+08
4   Afghanistan          AFG  1964  8.000000e+08
5   Afghanistan          AFG  1965  1.006667e+09
6   Afghanistan          AFG  1966  1.400000e+09
7   Afghanistan          AFG  1967  1.673333e+09
8   Afghanistan          AFG  1968  1.373333e+09
9   Afghanistan          AFG  1969  1.408889e+09
10  Afghanistan          AFG  1970  1.748887e+09

In [30]:
df[0:200:50] # step is 50

                    country_name country_code  year         value
0                    Afghanistan          AFG  1960  5.377778e+08
50   Africa Eastern and Southern          AFE  1968  3.632779e+10
100  Africa Eastern and Southern          AFE  2018  1.010000e+12
150   Africa Western and Central          AFW  2005  3.110000e+11

In [32]:
df['country_name'].head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country_name, dtype: object

In [35]:
df[['country_name','country_code']].head(3)

  country_name country_code
0  Afghanistan          AFG
1  Afghanistan          AFG
2  Afghanistan          AFG

In [37]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
year,13365.0,1.994479e+03,1.745958e+01,1960.00,1.980000e+03,1.996000e+03,2.009000e+03,2.022000e+03
value,13365.0,1.207051e+12,5.413230e+12,8824746.24,2.523472e+09,1.842778e+10,2.240000e+11,1.010000e+14

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13365 entries, 0 to 13364
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   country_name  13365 non-null  object
 1   country_code  13365 non-null  object
 2   year          13365 non-null  int64
 3   value         13365 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 417.8+ KB

In [40]:
df['value'].describe()

count    1.336500e+04
mean     1.207051e+12
std      5.413230e+12
min      8.824746e+06
25%      2.523472e+09
50%      1.842778e+10
75%      2.240000e+11
max      1.010000e+14
Name: value, dtype: float64